hackathon/src/Enums/СтатусыОбработки/СтатусыОбработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыОбработки</name>
  <enumValues>
    <name>КОбработке</name>
  </enumValues>
  <enumValues>
    <name>Обработан</name>
  </enumValues>
</mdclass:Enum>

hackathon/src/Enums/ИсточникиОбращений/ИсточникиОбращений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИсточникиОбращений</name>
  <enumValues>
    <name>РучноеСоздание</name>
  </enumValues>
  <enumValues>
    <name>СозданиеИзФормыОбработки</name>
  </enumValues>
  <enumValues>
    <name>Телеграм</name>
  </enumValues>
  <enumValues>
    <name>Почта</name>
  </enumValues>
  <enumValues>
    <name>Сайт</name>
  </enumValues>
</mdclass:Enum>

hackathon/src/CommonModules/СРОО_ФоновыеЗадания/Module.bsl
Функция ОтправитьЗапросИСоздатьОбращениеНаСервере(СсылкаИсточника, ЧатИД)
    
    // Отправляем запрос к ML-серверу
    ОтветСервера = СРОО_ОбщегоНазначения.ОтправитьЗапросКСерверу(СсылкаИсточника.ТекстОбращения, СсылкаИсточника);
    Если ОтветСервера = Неопределено Тогда
        Возврат Ложь;
    КонецЕсли;
    
    // Создаем обращение в базе данных
    Результат = СРОО_ОбщегоНазначения.СоздатьОбращениеВБазе(СсылкаИсточника.ТекстОбращения, ОтветСервера, СсылкаИсточника, ЧатИД);
    
    Возврат Результат;
    
КонецФункции

Процедура ОбработкаНовыхОбращений(СсылкаНаОбращение = Неопределено, ЧатИД = Неопределено) Экспорт
	ТекстЗапроса = "ВЫБРАТЬ
		|	ИсточникиОбращений.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ИсточникиОбращений КАК ИсточникиОбращений
		|ГДЕ
		|	ИсточникиОбращений.Статус = ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.СтатусыОбработки.КОбработке)";
	
	Запрос = Новый Запрос;
	
	Если ЗначениеЗаполнено(СсылкаНаОбращение) Тогда
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + "И ИсточникиОбращений.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбращение); 
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОтправитьЗапросИСоздатьОбращениеНаСервере(ВыборкаДетальныеЗаписи.Ссылка, ЧатИД);
	КонецЦикла;
КонецПроцедуры

Процедура ПолучитьПисьмаНаСервере() Экспорт
	ПоследняяДатаПолученияПисем = Константы.ПоследняяДатаПолученияПисем.Получить();
	Константы.ПоследняяДатаПолученияПисем.Установить(ТекущаяДата());
	Если НЕ ЗначениеЗаполнено(ПоследняяДатаПолученияПисем) Тогда
		ПоследняяДатаПолученияПисем = НачалоДня(ТекущаяДата());
	КонецЕсли;
	ПараметрыЗагрузки = новый Структура;
	СтруктураОтбора= новый Структура;
	СтруктураОтбора.Вставить("ПослеДатыОтправления", ПоследняяДатаПолученияПисем);
	
	ПараметрыЗагрузки.Вставить("Отбор", СтруктураОтбора);
	
	ПолученныеПисьма = РаботаСПочтовымиСообщениями.ЗагрузитьПочтовыеСообщения(
				Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты,
				ПараметрыЗагрузки);
	Для каждого Строка ИЗ ПолученныеПисьма Цикл
		Если Строка.ДатаОтправления < ПоследняяДатаПолученияПисем Тогда
			Продолжить;	
		КонецЕсли;
		НовыйЭлемент = Справочники.ИсточникиОбращений.СоздатьЭлемент();
		ПолученныйТекст = Строка.Тексты[0].Получить("Текст");
		ПолученныйТекст_Фильтр = СтрЗаменить(ПолученныйТекст, "<div>", "");
		ПолученныйТекст_Фильтр = СтрЗаменить(ПолученныйТекст_Фильтр, "</div>", "");
		НовыйЭлемент.ТекстОбращения = ПолученныйТекст_Фильтр;
		НовыйЭлемент.ТемаОбращения = Строка.Тема;
		НовыйЭлемент.ИсточникОбращения = Перечисления.ИсточникиОбращений.Почта;
		НовыйЭлемент.АвторОбращения = Строка.ИмяОтправителя;
		НовыйЭлемент.СсылкаНаАвтора = СРОО_ОбщегоНазначения.ПолучитьАвтораПоФИО(Строка.ИмяОтправителя);
		НовыйЭлемент.Статус = Перечисления.СтатусыОбработки.КОбработке;      
		
		НовСтр = НовыйЭлемент.ДопСвойства.Добавить();
		НовСтр.Свойство = "Отправитель";
		НовСтр.Значение = Строка.Отправитель;
		
		НовСтр = НовыйЭлемент.ДопСвойства.Добавить();
		НовСтр.Свойство = "Идентификатор";
		НовСтр.Значение = Строка.Идентификатор[0];
		НовыйЭлемент.Наименование = СтрШаблон("Обращение №%1 Почта", НовыйЭлемент.ТемаОбращения);
		НовыйЭлемент.Записать();
		НовыйЭлемент.Наименование = СтрШаблон("Обращение №%1 Почта", НовыйЭлемент.Код);
	КонецЦикла;
	
КонецПроцедуры
